// Scans RUN and RUNONCE registry keys
// Github Author: k4dxk4
// The purpose of this script is to scan registry values that are used to maintain malware-persistence
// while allowing the analyst to enter InitiatingProcessFileNames to assist in weeding-out common false
// positives for their environment
DeviceRegistryEvents 
| where ActionType == "RegistryValueSet" 
| where RegistryKey startswith @"HKEY_LOCAL_MACHINE\Software\Microsoft\Windows\CurrentVersion\Run"
     or RegistryKey startswith @"HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Run"
     or RegistryKey startswith @"HKEY_LOCAL_MACHINE\Software\Microsoft\Windows\CurrentVersion\RunOnce"
     or RegistryKey startswith @"HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\RunOnce"
// Add or remove InitiatingProcessFileName values based on your environment (choose what you want to ignore/false pos.)
| where InitiatingProcessFileName != "msiexec.exe" 
    and InitiatingProcessFileName != "drvinst.exe"
    and InitiatingProcessFileName != "msmpeng.exe"
    and InitiatingProcessFileName !contains "logioptions" 
| project Timestamp, DeviceName, RegistryKey, RegistryValueData, InitiatingProcessFileName, InitiatingProcessCommandLine 